app/Controllers/Account.php

    public function profile()
    {
        // Only allow access if logged in
        if (!session('isLoggedIn')) {
            return redirect()->to(base_url('account/login'));
        }
        // Pass user data to the view if needed
        $user_id = session('user_id');
        $user = null;
        if ($user_id) {
            $user = $this->accountModel->find($user_id);
---
SELECT *
FROM `user_accounts`
WHERE `user_accounts`.`id` = '100003'

    public function notifications()
    {
        if (!session('isLoggedIn')) {
            return redirect()->to(base_url('account/login'));
        }
        $user_id = session('user_id');
        $user = $this->accountModel->find($user_id);
---
SELECT *
FROM `user_accounts`
WHERE `user_accounts`.`id` = '100002'