app/Controllers/Account.php

    public function continueWatching()
    {
        if (!session('isLoggedIn')) {
            return redirect()->to(base_url('account/login'));
        }
        $user_id = session('user_id');
        $user = $this->accountModel->find($user_id);
---
SELECT *
FROM `user_accounts`
WHERE `user_accounts`.`id` = '100002'