app/Controllers/Admin.php

    public function getMetricsData()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(403);
        }

        $db = \Config\Database::connect();
        $animeViewModel = new \App\Models\AnimeViewModel();

        // Get total views
        $totalViews = $db->query("SELECT SUM(views) as total FROM anime_views")->getRow()->total ?? 0;

        // Get views for different periods
        $viewsToday = $db->query("SELECT SUM(views) as total FROM anime_views WHERE DATE(viewed_at) = CURDATE()")->getRow()->total ?? 0;
        $viewsWeek = $db->query("SELECT SUM(views) as total FROM anime_views WHERE viewed_at >= DATE_SUB(NOW(), INTERVAL 7 DAY)")->getRow()->total ?? 0;
        $viewsMonth = $db->query("SELECT SUM(views) as total FROM anime_views WHERE viewed_at >= DATE_SUB(NOW(), INTERVAL 30 DAY)")->getRow()->total ?? 0;

        // Get user accounts data
        $totalAccounts = $this->accountModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `user_accounts`