app/Controllers/Admin.php

    public function getAccount($id)
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(403);
        }

        $account = $this->accountModel->find($id);
---
SELECT *
FROM `user_accounts`
WHERE `user_accounts`.`id` = '100002'

    public function getAccounts()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(403);
        }

        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = (int) ($this->request->getGet('per_page') ?? 20);
        $search = $this->request->getGet('search') ?? '';
        $type = $this->request->getGet('type') ?? '';

        $builder = $this->accountModel->orderBy('created_at', 'DESC');

        if (!empty($search)) {
            $builder->groupStart()
                   ->like('username', $search)
                   ->orLike('display_name', $search)
                   ->orLike('email', $search)
                   ->groupEnd();
        }

        if (!empty($type)) {
            $builder->where('type', $type);
        }

        $totalItems = $builder->countAllResults(false);
        $accounts = $builder->paginate($perPage, 'default', $page);
---
SELECT *
FROM `user_accounts`
ORDER BY `created_at` DESC
 LIMIT 1000
SELECT COUNT(*) AS `numrows`
FROM `user_accounts`