app/Models/AccountModel.php

    public function verifyCredentials($email, $password)
    {
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `user_accounts`
WHERE `email` = 'admin@admin.com'
 LIMIT 1

    public function isFollowingAnime($userId, $animeId)
    {
        $user = $this->find($userId);
---
SELECT *
FROM `user_accounts`
WHERE `user_accounts`.`id` = '100002'