app/Models/AnimeViewModel.php

SELECT `anime_views`.`anime_id`, `anime_data`.`title`, `anime_data`.`type`, `anime_data`.`ratings`, `anime_data`.`backgroundImage`, `anime_data`.`genres`, `anime_data`.`total_ep`, `anime_data`.`status`, `anime_data`.`studios`, `anime_data`.`synopsis`, SUM(anime_views.views) as total_views
FROM `anime_views`
JOIN `anime_data` ON `anime_data`.`anime_id` = `anime_views`.`anime_id`
WHERE `anime_views`.`viewed_at` >= '2025-07-13 00:00:00'
GROUP BY `anime_views`.`anime_id`
ORDER BY `total_views` DESC
---
    public function getTrendingByPeriod($period = 'today', $limit = 10)
    {
        $db = \Config\Database::connect();
        // Define periods in fallback order
        $periodOrder = ['today', 'week', 'month', 'all'];
        $periods = [
            'today' => date('Y-m-d 00:00:00'),
            'week' => date('Y-m-d H:i:s', strtotime('-7 days')),
            'month' => date('Y-m-d H:i:s', strtotime('-1 month')),
            'all' => null // all-time
        ];
        // Start with the selected period, then fallback to next periods
        $startIndex = array_search($period, $periodOrder);
        $orderedPeriods = array_slice($periodOrder, $startIndex);
        $result = [];
        $animeIds = [];
        // For each period in order, fill up to $limit unique anime
        foreach ($orderedPeriods as $p) {
            $builder = $db->table('anime_views');
            $builder->select('anime_views.anime_id, anime_data.title, anime_data.type, anime_data.ratings, anime_data.backgroundImage, anime_data.genres, anime_data.total_ep, anime_data.status, anime_data.studios, anime_data.synopsis, SUM(anime_views.views) as total_views')
                ->join('anime_data', 'anime_data.anime_id = anime_views.anime_id')
                ->groupBy('anime_views.anime_id')
                ->orderBy('total_views', 'DESC');
            if ($periods[$p] !== null) {
                $builder->where('anime_views.viewed_at >=', $periods[$p]);
            }
            $rows = $builder->get()->getResultArray();