app/Models/NotificationModel.php

SELECT *
FROM `user_notifications`
WHERE `user_id` = '100002'
ORDER BY `created_at` DESC
 LIMIT 50
---
    public function getUserNotifications($userId, $limit = 50)
    {
        return $this->where('user_id', $userId)
                   ->orderBy('created_at', 'DESC')
                   ->limit($limit)
                   ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `user_notifications`
WHERE `user_id` = '100002'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                   ->where('is_read', 0)
                   ->countAllResults();