app/Models/UserSessionModel.php

SELECT `device_type`, COUNT(*) as count
FROM `user_sessions`
WHERE `last_activity` >= '2025-08-09 08:39:19'
GROUP BY `device_type`
---
    public function getDeviceStats($period = 'week')
    {
        $builder = $this->builder();

        switch ($period) {
            case 'today':
                $builder->where('DATE(last_activity)', date('Y-m-d'));
                break;
            case 'week':
                $builder->where('last_activity >=', date('Y-m-d H:i:s', strtotime('-7 days')));
                break;
            case 'month':
                $builder->where('last_activity >=', date('Y-m-d H:i:s', strtotime('-30 days')));
                break;
        }

        $results = $builder->select('device_type, COUNT(*) as count')
                          ->groupBy('device_type')
                          ->get()
                          ->getResultArray();